{
    "data": [
      {
        "id": "MDEwOlJlcG9zaXRvcnkyNDU0NjcyNzQ=",
        "name": "Automated Question Type Coding for Forensic Interviews",
        "createdAt": "",
        "url": "",
        "description": "🔥 Led the development of an automated question coding system using real forensic interview data. Introduced a novel 4-type model that achieved high human-machine agreement, demonstrating accuracy rates of 82% for non-questions, 82% for option-posing questions, 98% for wh-questions, and 96% for invitations, leveraging oversampling techniques and fine-tuning the RoBERTa  model from HuggingFace for optimal performance.",
        "isFork": false,
        "languages": [
          {
            "name": "Python",
            "iconifyClass": "logos-python"
          },
          {
            "name": "Pytorch",
            "iconifyClass": "logos-pytorch"
          }
        ]
      },
      {
        "id": "R_kgDOG_vYHA",
        "name": "Text Based Image Retrieval via Low-Resourced Indic Languages",
        "createdAt": "",
        "url": "",
        "description": "📦 Contributed to a resilient image retrieval system for low-resourced Indic languages. Implemented a Siamese network with triplet loss, achieving 68.83% and 66.66% accuracy for English and Hindi models which is 2% more than the current benchmarks, and utilized MuRIL for effective text embedding.",
        "isFork": false,
        "languages": [
          {
            "name": "Python",
            "iconifyClass": "logos-python"
          },
          {
            "name": "Pytorch",
            "iconifyClass": "logos-pytorch"
          }
        ]
      },
      {
        "id": "R_kgDOG0_8uQ",
        "name": "Constellation: An End-to-End Machine Learning Platform",
        "createdAt": "",
        "url": "",
        "description": "🌀  Played a pivotal role in building a potent MLOps platform, reducing model deployment and management time by 70%. Directed the creation of a user-friendly SDK for seamless integration, boosting efficiency. Architected vital features like model versioning, automated testing, and performance monitoring, yielding a 50% accuracy improvement. Utilized AutoML for 60% faster model selection and 75% quicker hyperparameter tuning and feature engineering.",
        "isFork": false,
        "languages": [
          {
            "name": "Python",
            "iconifyClass": "logos-python"
          },
          {
            "name": "Scikit-learn",
            "iconifyClass": "devicon:scikitlearn"
          }
        ]
      },
      {
        "id": "R_kgDOGcPKSQ",
        "name": "Helmet and Number Plate Detector",
        "createdAt": "",
        "url": "",
        "description": "⚙️  Developed a prototype using YOLOv5 achieving 78% accuracy in detecting helmet-less riders and capturing number plates. Applied object detection for precise helmet detection and used PyTesseract OCR for extracting text from the detected number plates.",
        "isFork": false,
        "languages": [
          {
            "name": "Python",
            "iconifyClass": "logos-python"
          },
          {
            "name": "OpenCV",
            "iconifyClass": "logos-opencv"
          }
        ]
      },
      {
        "id": "MDEwOlJlcG9zaXRvcnkzMjcyMjI5Njk=",
        "name": "Foreign Object Debris (FOD) Detection on Runways",
        "createdAt": "",
        "url": "",
        "description": "🚀   Conducted research into FOD detection, focusing on CNN-based object detection and segmentation techniques. Explored the potential of millimeter-wave and radio waves technologies for FOD detection. Presented findings in a seminar, effectively communicating the research on advanced FOD detection approaches.",
        "isFork": false,
        "languages": [
          {
            "name": "Python",
            "iconifyClass": "logos-python"
          }
        ]
      }
      
    ]
  }
  